[{"slug":"video6","draft":false,"title":"Create Universal Blazor API Components for Blazor Server and WASM","tags":["blazor"," server"," tailwind"],"date":"\/Date(1672790400000+0000)\/","content":"In this video tutorial, we'll walk through the process of creating universal Blazor API components for Blazor Server \nand Blazor WASM using the ServiceStack.Blazor library. \n\nBy using the ServiceStack.Blazor library, developers can create UI components that can be shared between their Blazor \napplications without worrying about which hosting model is used. This allows developers to streamline their development \nprocess and reduce the amount of code they need to write, making it easier to build and maintain complex applications.","url":"https://youtu.be/66DgLHExC9E","wordCount":97,"lineCount":14,"group":"blazor"},{"slug":"video2","draft":false,"title":"Vue 3 Tailwind Components Library","tags":["vue","autoquery"],"date":"\/Date(1676332800000+0000)\/","content":"In this video, we demonstrate using the @servicestack/vue components library for Vue.js 3 Multipage Apps (MPAs) along \nwith the **vue-mjs** template. \n\nThe template illustrates building content-heavy or complex sites while avoiding the intricacies of Single Page Apps (SPAs) \nthrough the use of JavaScript Modules, Tailwind, Vue.js, Razor Pages, and ServiceStack.","url":"https://youtu.be/YIa0w6whe2U","wordCount":62,"lineCount":11,"group":"vue"},{"slug":"video1","draft":false,"title":"Instantly Manage your data using AutoQueryGrid Vue","tags":["vue","autoquery"],"date":"\/Date(1678924800000+0000)\/","content":"This walkthrough explores the ServiceStack Vue 3 library and the functionality of the AutoQueryGrid component. The AutoQueryGrid component simplifies the integration of AutoQuery services by generating a customizable UI. \n\nBy following this guide, you'll learn how to effectively utilize these tools to enhance your application's user interface and overall user experience.","url":"https://youtu.be/znCoC-Ct0Ps","wordCount":63,"lineCount":10,"group":"vue"},{"slug":"razor-ssg","draft":false,"title":"Using Razor SSG to Create Websites in GitHub Codespaces","tags":["razor-pages"," ssg"," tailwind"," codespaces"],"date":"\/Date(1680048000000+0000)\/","content":"This video takes an in-depth look at the [razor-ssg](https://razor-ssg.web-templates.io) ServiceStack template, a powerful tool that \nharnesses the power of .NET Razor Pages to provide seamless static site generation (SSG) capabilities \n\nWith GitHub Codespaces integration, you can develop, test, and manage your application all within your browser, eliminating the need \nfor a dedicated development environment and expediting your workflow, which can all be done on the go from an iPad","url":"https://youtu.be/MRQMBrXi5Sc","wordCount":90,"lineCount":13,"group":"projects","order":3},{"slug":"video1","draft":false,"title":"New Mailchimp self-host mail management alternative","tags":["creatorkit","mail","tailwind"],"date":"\/Date(1686182400000+0000)\/","content":"In this video we introduce CreatorKit an OSS self-hosting alternative to Mailchimp for managing mailing lists,\nnewsletter subscriptions, email templating, marketing campaigns & more whose tailwind components can be easily \nintegrated into any existing website.\n\nIt's an ideal companion for .NET Apps looking to manage their mailinglist and newsletter subscribers in an\nisolated customizable .NET App with support for creating custom email layouts, templates and mail campaigns.","url":"https://youtu.be/_qDVtfcHf14","wordCount":75,"lineCount":12,"group":"creatorkit"},{"slug":"video2","draft":false,"title":"New Disqus OSS self-host alternative for .NET Websites","tags":["creatorkit","posts","tailwind"],"date":"\/Date(1686268800000+0000)\/","content":"In this video we explore how we can use CreatorKit - a self-hosting alternative to Disqus to add comments, voting\nand moderation to any existing page or blog post.\n\nCreatorKit is especially useful for adding dynamic post comment and voting features to Jamstack and other\nstatically generated websites which can continually be statically pre-rendered and hosted on CDN's whilst its \ndynamic features are powered by an external CreatorKit instance.","url":"https://youtu.be/lgpl-VjxtdU","wordCount":79,"lineCount":12,"group":"creatorkit"},{"slug":"blazor","draft":false,"title":"Blazor Tailwind App for .NET 8","tags":["blazor"," tailwind"],"date":"\/Date(1700524800000+0000)\/","content":"ServiceStack's new Blazor project template takes advantage of .NET 8 Blazor's new features that redefines modern Web\nDevelopment in C# which we explore in this video overview, covering how the template adopts Blazor's familiar ASP.NET\nCore Identity and Entity Framework for its authentication, utilizes the modern Tailwind CSS framework for beautiful\nresponsive design and adopts .NET's best-practice Docker Containerization support for its built-in GitHub Action\nDeployments - enabling a simple ready-made CI solution for deployment to any Linux Host via SSH and Docker compose.","url":"https://youtu.be/hqyozHSL0Nk","wordCount":94,"lineCount":12,"group":"projects","order":2},{"slug":"blazor-vue","draft":false,"title":"Fast, SEO-friendly, Blazor Static Rendered Apps with Vue","tags":["blazor"," tailwind"," vue"],"date":"\/Date(1700611200000+0000)\/","content":"The new **Blazor Vue** template is ideal for building Fast, SEO-friendly, 100% statically rendered Blazor Web Apps where \nall its dynamic functionally uses Vue.js to progressively enhance Blazor's statically rendered content - eliminating Blazor's \ncurrent limitations of being able to use Blazor SSR to develop an entire App without any of Blazor Interactivity downsides.\n\nThe new [blazor-vue](/posts/net8-best-blazor) template implements all the features of the [blazor](/posts/net8-blazor-template) \ntemplate but reimplements all its interactive features with **Vue.js** to and the \n[Vue Components library](https://docs.servicestack.net/vue/), with both templates combining the latest advancements in \nBlazor .NET 8 with **Tailwind CSS** styling for creating beautiful Responsive Websites with support for Dark Mode.","url":"https://youtu.be/ujbTGn4IwFs","wordCount":131,"lineCount":16,"group":"projects","order":1}]